## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.externaldns[0].kubernetes_deployment.externaldns is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "externaldns" {
      ~ id               = "externaldns/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ resource_version = "3956861" -> (known after apply)
          ~ uid              = "c82d9fa7-b49d-413d-a2ed-b08c3e54a710" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                    # (13 unchanged attributes hidden)

                  ~ container {
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "external-dns"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (7 unchanged attributes hidden)

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (1 unchanged block hidden)
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)

                  ~ security_context {
                      - supplemental_groups    = [] -> null
                        # (5 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

  ```
  
  Plan exit code: 0
  